---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.WireDistributionDirection.Major
enum: Autodesk.Revit.DB.Structure.WireDistributionDirection
source: html/2c5558b4-57d4-1b81-e843-e79c5c1bbc21.htm
---
# Autodesk.Revit.DB.Structure.WireDistributionDirection.Major

Wires are distributed in the Major direction.
 Uncomment following for 2020.1
 text "Major"